/**
 * dns解析
 * 在浏览器输入url之后，浏览器首先会进行dns解析，找到对应的ip地址
 */
/**
 * dns解析的流程
 * 1、在浏览器缓存中查找；如果没查找到，进行第二步；
 * 2、在系统缓存中查找；（在操作系统中可以通过设置系统中hosts文件，来改变域名查找的ip；比如在公司中，使用switchhost来改变IP，达到不同环境的目的）；
 * 3、路由器缓存
 * 4、ISP DNS 查找
 * 5、递归搜索
 *  a、本地服务向根域发送一个请求；（www.baidu.com.）.写的时候就省略，实际是域名的根域；
 *  b、根域将所查询的顶级域返回本地（www.baidu.com.  com是顶级域）；
 *  c、本地服务器根据返回的ip再向顶级域（com）发送请求；
 *  d、顶级域在将二级域（baidu）的ip反给本地
 *  e、本地服务再向二级域发送请求，直到查询到域名的ip；
 */

/**
 * dns有关的网络优化
 * 1、减少dns查询，避免重定向   浏览器dns缓存、计算机dns缓存、服务器dns缓存、使用keep-alive特性来减少dns查找。
 *  a、服务器可以设置ttl值表示dns的存活时间。本机dns缓存将根据这个ttl值判断dns记录什么时候被抛弃；
 *  b、浏览器dns缓存也有自己的过期时间，这个时间是独立于本机dns缓存的，相对也比较短，例如chrome只有一分钟左右；
 *  c、浏览器dns记录的数量是有限制的，如果短时间内访问了大量不同域名的网站，则较早的记录被抛弃；不过操作系统的dns缓存有很大几率保留着该记录，这样可以避免通过网络查询而带来的延迟
 * 2、dns的预解析；
 *  a、通过meta信息来告知浏览器，我这个页面要做dns解析；<meta http-equiv="x-dns-prefetch-control" content="on" />
 *  b、使用link标签强制对dns做与解析；<link rel="dns-prefetch" href="http://ww.why.com" />
 */